Tekla Open API Reference for Tekla Structures 2025
Bolt.Attributes Property
 The attributes of the bolt. For more information see Bolt.BoltAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Bolt.BoltAttributes Attributes { get; set; }
Public Property Attributes As Bolt.BoltAttributes
	Get
	Set
Property Value
Type: Bolt.BoltAttributes
See Also
Reference
Bolt Class
Tekla.Structures.Drawing Namespace